[
  {
    "id": 1,
    "title": "Requirements specification of the internship project",
    "description": "- Problem has been clearly stated and its significance discussed.<br>- Clear definition of the internship project requirements with specific deliverables.<br>- Requirements specification documented with adequate level of details using suitable methods and tools such as use cases.<br>- Clear and realistic project timeline is given",
    "category": "Report",
    "grade": 15
  },
  {
    "id": 2,
    "title": "Solution design, implementation and testing",
    "description": "- The project solution design and implementation presented with adequate level of details with justification of design choices.<br>- The solution documented using suitable methods and tools.<br>- If applicable, evidence presented of sufficient testing of the solution confirming that the system has been successfully implemented and meets the requirements. Testing results presented with appropriate level of details with accuracy and completeness.<br>- If applicable, the solution deployment is presented with adequate level of details.",
    "category": "Report",
    "grade": 40
  },
  {
    "id": 3,
    "title": "Conclusions and Reflections",
    "description": "- Conclusions drawn were appropriate and well-supported by the work done<br>- Detailed student reflections and detailed internship learning outcomes well-supported by the work<br>- ideas for future work presented",
    "category": "Report",
    "grade": 12
  },
  {
    "id": 4,
    "title": "Quality of the report organization and writing style",
    "description": "- Well-structured: each section has a clear and unique function. Hierarchy of sections is correct. Ordering of sections is logical.<br>- Appropriate writing style, grammar, spelling and proper citation of references.<br>- Level of detail is appropriate throughout.<br>- Engineering and technical terms are used correctly. <br>- All figures, equations, graphs, charts, and drawings are accurate, numbered with a title, consistent with the text, and of good quality.  They enhance understanding of the text.",
    "category": "Report",
    "grade": 8
  },
  {
    "id": 5,
    "title": "Organization",
    "description": "- Presentation well-organized and clearly structured: information presented in logical and interesting sequence that the audience can easily follow.<br>- Good quality and neat visual aids with good use of graphs and graphics.",
    "category": "Presentation",
    "grade": 5
  },
  {
    "id": 6,
    "title": "Technical Content",
    "description": "- Presentation provides pertinent, concise to-the-point and clearly explained information.<br>- Material is covered with adequate depth.",
    "category": "Presentation",
    "grade": 6
  },
  {
    "id": 7,
    "title": "Delivery",
    "description": "- Relaxed and lively though understandable talk with high level of confidence and enthusiasm.<br>- Speaks clearly and uses appropriate language such that it keeps audience’s attention<br>- Presenter added value to slides (as opposed to merely reading them)<br>- Meets time limit (20 minutes).<br>- Adequately answering the questions: student is able to give appropriate, clear and to-the-point answers to the questions.",
    "category": "Presentation",
    "grade": 14
  }
]
